/*-secure-
{"_perm_cache_times":{"pagetime":1336807145,"foldertime":1273260772,"permtime":1296499724},"_valid_as_of":1336807308,"author":{"perm":"admin","name":"William R. Zwicky","first_name":"William R.","last_name":"Zwicky","email":"wrzwicky@pobox.com","image":"http:\/\/files.pbworks.com\/userimage\/e27cda3470cb4359f5676dc94a968d8048d1ef28\/yes\/48x48\/1278122855","lastview":1336806900,"lastviewtext":"6 minutes","is_verified":true,"uid":"bed028d9953d4e1825545766a1ac21c043a9537a"},"current_revision":1292923800,"hasPlugins":false,"has_custom_perms":false,"hidden":false,"html":"<h1>Specifying Coordinate Reference Systems<\/h1>\n<p>&nbsp;<\/p>\n<p>Dp2Kml an Csv2Kml can convert coordinates to the system required by  Google Earth.&nbsp; To do this, they need to know what system is being used  by the input file.&nbsp; Since coordinate systems are a nightmare to deal with, the programs use <a href=\"http:\/\/www.geotools.org\/\">GeoTools<\/a> to provide the conversion as well as definitions of different coordinate systems.<\/p>\n<p>&nbsp;<\/p>\n<p>Both program accept a coordinate system specification on their command lines using the syntax \"<span style=\"font-family:'Courier New';\">--crs &lt;file or name&gt;<\/span>\".&nbsp; The parameter can either be a file name, or a specially coded CRS name.<\/p>\n<p>&nbsp;<\/p>\n<ul><li><strong>CRS name:<\/strong> The best option is to supply one of the CRS name strings documented by <a href=\"http:\/\/spatialreference.org\/\">http:\/\/spatialreference.org\/<\/a> .&nbsp;&nbsp; These names take the form \"<span style=\"font-family:'Courier New';\">EPSG:####<\/span>\" or \"<span style=\"font-family:'Courier New';\">SR-ORG:####<\/span>\", and generally contain all the parameters GeoTools needs to perform a conversion.<\/li>\n<\/ul><p>&nbsp;<\/p>\n<ul><li><strong>File name:<\/strong>&nbsp; If the parameter exists as a file, then the file is loaded as a projection file.&nbsp; GeoTools supports a variety of formats, but it's very picky about the file being <em>complete<\/em>.&nbsp; If any data is missing from the file (and some of the parameters are quite obscure) then the program will crash.&nbsp; It's generally much better to find the CRS name, and use GeoTools' internal projection data.<\/li>\n<\/ul><p>&nbsp;<\/p>\n<p>Note that the EPSG name system is the most reliable way to get a successful conversion.&nbsp; If a workable name cannot be found, the next best option is to re-project the input data into a system documented on that site.&nbsp; It can be quite difficult to build a projection file that GeoTools will accept, and we the developers have not been successful.&nbsp; The file needs to look something like <a href=\"http:\/\/jira.codehaus.org\/browse\/GEOT-2353\">these examples<\/a> (ignore the bug described there, it's not relevant.)&nbsp; ESRI doesn't seem to produce files in that format, though the GeoTools docs say it can.&nbsp; Further, GeoTools requires certain parameters be present in the file, but it's rare to find a projection file that contains these parameters.<br \/><br \/>If you can convince the tools to accept your projection file, then you can use that.&nbsp; But the EPSG:number system is the best idea.&nbsp; GeoTools works best with those, and it ensures you're using a well-known coordinate system.<\/p>\n<p>&nbsp;<\/p>\n<hr \/><p>&nbsp;<\/p>","locked":false,"mtime":1292923800,"name":"Coord Ref Systems","oid":34054800,"perms":{"r":true},"revcount":4,"revurl":"http:\/\/digitalpopulations.pbworks.com\/w\/page\/34054800\/Coord%20Ref%20Systems","size":2906,"wikistyle":false}
*/
