/*-secure-
{"_perm_cache_times":{"pagetime":1336807145,"foldertime":1273260772,"permtime":1296499724},"_valid_as_of":1336807344,"author":{"perm":"admin","name":"Chuck Ehlschlaeger","first_name":"Chuck","last_name":"Ehlschlaeger","email":"chuck.ehlschlaeger@gmail.com","image":"http:\/\/files.pbworks.com\/userimage\/682172d3a8d5562604ae23d8bd63664e2169ea41\/yes\/48x48\/1291573307","lastview":1336750500,"lastviewtext":"15 hours","is_verified":true,"uid":"a9e0a2f3702dbb751fad2b8bf22314b8246485fb"},"current_revision":1288986186,"hasPlugins":false,"has_custom_perms":false,"hidden":false,"html":"<p>To help create the control files, Digital Populations provides a GUI to help the user select and describe the input files. &nbsp;Operation is as simple as walking through the tabs one at a time, and filling out the fields.<\/p>\n<p>&nbsp;<\/p>\n<h2>Tab “Land Use”<\/h2>\n&nbsp;\n<p>The Land Use tab specifies a raster map as described above plus simplifying criteria.<\/p>\n<p>&nbsp;<\/p>\n<p><img id=\"pbImage965953\" style=\"display:block;text-align:center;border-width:0px;\" src=\"\/f\/1274336316\/dpgui-landuse.png\" alt=\"DPGUI land use tab.\" width=\"630\" height=\"613\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Land Use Map File<\/strong> specifies the raster map file itself. &nbsp;Digital Populations&nbsp;doesn't care about the meaning of the groups; it only cares about the population density of each cell in the map. &nbsp;The lower part of this tab is used to create <strong>Class Groups<\/strong>, where the classes in each group are expected to have similar densities. &nbsp;Digital Populations&nbsp;will compute the actual density value, then try to mimic this value when placing households on the map.<\/p>\n<p>&nbsp;<\/p>\n<p>To create a group,simply select one or more classes from the list under <strong>Ungrouped Classes<\/strong>, then drag them into <strong>Class Groups<\/strong>. &nbsp;DPGUI will automatically create a group with a default class number and name. &nbsp;Both of these can be freely changed. &nbsp;Selecting a group will display its contents under <strong>Members in Groups<\/strong>, and classes can be dragged in and out of this list as well.<\/p>\n<p>&nbsp;<\/p>\n<p>The first line of Class Groups is the “vacant cell” class, and always implies a total lack of households. &nbsp;Classes that have no residents should be dragged to this group. &nbsp;The name can be changed, but this group has no number.<\/p>\n<p>&nbsp;<\/p>\n<p>Digital Populations&nbsp;requires all classes to be grouped before a run, so please ensure the Ungrouped Classes list is empty before using the relationship file.<\/p>\n<p>&nbsp;<\/p>\n<h2>Tab “Regions\/Tracts”<\/h2>\n&nbsp;\n<p>To compute the best location for each household, Digital Populations&nbsp;needs a set of statistics that it can target. &nbsp;It also needs a map defining the regions for which goal statistics are provided. &nbsp;These regions also define the resolution at which Digital Populations&nbsp;will work: &nbsp;households will be placed into regions in a way that closely mimics the statistics, but the exact location of each household within the region will be random.<\/p>\n<p>&nbsp;<\/p>\n<p><img id=\"pbImage198500\" style=\"display:block;text-align:center;border-width:0px;\" src=\"\/f\/1274336319\/dpgui-regions.png\" alt=\"DPGUI regions tab.\" width=\"630\" height=\"266\" \/><\/p>\n<p><strong>Map File<\/strong> specifies the raster map that provides the location of each region, and <strong>Table File<\/strong> provides the composite statistics for each region. &nbsp;Each cell in the map has a number indicating the region it belongs to, and each row in the table provides data for one region. &nbsp;<strong>Key Field<\/strong> specifies the column within the table file that links the two files, specifying the region for which the row provides data.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Household Count Field<\/strong> specifies the column that gives the total number of households in each region, while <strong>Population Count Field<\/strong> does the same for individuals. &nbsp;<strong>Vacant Household Count Field<\/strong> gives the number of households in each region that are unoccupied.<\/p>\n<p>&nbsp;<\/p>\n<h2>Tab “Households”<\/h2>\n&nbsp;\n<p>Rather than fabricating households from whole cloth, DP instead takes a table of “archetype households” which will be cloned as needed to populate the final map. &nbsp;This table should contain a thorough sampling of real households, as characteristics (combinations or traits of household members) absent from this table will be absent from the output map as well.<\/p>\n<p>&nbsp;<\/p>\n<p><img id=\"pbImage233597\" style=\"display:block;text-align:center;border-width:0px;\" src=\"\/f\/1274336314\/dpgui-households.png\" alt=\"DPGUI households tab.\" width=\"630\" height=\"195\" \/>&nbsp;<\/p>\n<p><strong>Table File<\/strong> specifies the household table where each row describes one household. &nbsp;<strong>Unique ID Field<\/strong> gives each household a unique number or code that the population table can refer to. &nbsp;<strong>Member Count Field<\/strong> specifies the number of people living in each household. &nbsp;DP will compute this count from the population table if provided.<\/p>\n<p>&nbsp;<\/p>\n<h2>Tab “Population”<\/h2>\n&nbsp;\n<p>Digital Populations&nbsp;also accepts an optional archetype population table that provides specific data for the members of each household.<\/p>\n<p>&nbsp;<\/p>\n<p><img id=\"pbImage835666\" style=\"display:block;text-align:center;border-width:0px;\" src=\"\/f\/1274336318\/dpgui-population.png\" alt=\"DPGUI population tab.\" width=\"630\" height=\"173\" \/>&nbsp;<\/p>\n<p><strong>Table File<\/strong> specifies the population table where each row describes one individual. &nbsp;<strong>Household ID Field<\/strong> provides the value from the household table's Unique ID Field that identifies the specific house this person lives in. &nbsp;Records without household ID values will be ignored.<\/p>\n<p>&nbsp;<\/p>\n<h2>Tab “Traits”<\/h2>\n&nbsp;\n<p>The Traits tab is the hardest part of the system to understand, as it describes how the above tables are to be used to generate a new census. &nbsp;Each row here describes a characteristic along with how to calculate the characteristic from the above tables. &nbsp;Digital Populations&nbsp;uses these rows to evaluate the quality of arrangements of households.<\/p>\n<p>&nbsp;<\/p>\n<p>Digital Populations&nbsp;starts by internally creating two traits from Household Count Field and Vacant Household Count Field above. &nbsp;These ensure the raw numbers of households are correct, and along with the population density data computed from the land use files, that the households are distributed where the people actually live.<\/p>\n<p>&nbsp;<\/p>\n<p>The Traits tab allows the user to specify additional criteria so that the households place actually mirror important characteristics of the actual population being studied. &nbsp;DP does not necessarily use all the criteria listed here; it requires another “fitting criteria” file to select which of these rows will be used in a given run.<\/p>\n<p>&nbsp;<\/p>\n<p><img id=\"pbImage491\" style=\"display:block;text-align:center;border-width:0px;\" src=\"\/f\/1274336321\/dpgui-traits.png\" alt=\"DPGUI traits tab.\" width=\"630\" height=\"350\" \/>&nbsp;<\/p>\n<p><strong>Description<\/strong> is a free-text field that lets the user give each row a useful name.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Region Trait<\/strong> and <strong>Region Total<\/strong> specify columns from the Regions\/Tracts table that together form a target proportion for each region. &nbsp;For example, the second row “Male” specifies the number of males in each region as the numerator, and the total number of people in each region as the denominator, resulting in the percentage of each region that is male. &nbsp;DP will place households in each region so that the proportion of individuals placed that are male is close to this target.<\/p>\n<p>&nbsp;<\/p>\n<p>The remaining five columns describe how to compute a proportion from the households placed in a map. &nbsp;<strong>Trait Table<\/strong> specifies whether the numerator will come from the household table (on the Households tab) or the population table. &nbsp;<strong>Trait Field<\/strong> specifies which column from that table provides the required value. &nbsp;<strong>Total Table<\/strong> and <strong>Total Field<\/strong> work the same way, but provide the denominator.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Trait Select<\/strong> controls the way the values from Trait Field are used. &nbsp;If left blank, Digital Populations&nbsp;will simply add together all the values, and divide by the sum of the Total Field values, effectively providing and average over the households in question. &nbsp;If a list of values or ranges is given here, Digital Populations&nbsp;will instead count the number of objects (households or persons) that have a Trait Field value that is one of the values listed, then divide by the Total Field sum as above.<\/p>\n<p>&nbsp;<\/p>\n<p>In the above example, the row labeled Male needs to compute the proportion of a region's population that is male. &nbsp;This is accomplished by counting the number of males, and dividing by the total number of people. &nbsp;The Population table doesn't have a “MALE Y\/N” column, but instead provides a “SEX” column containing a code that indicates the gender of each person. &nbsp;So POPULATION\/SEX\/1 selects all individuals with a SEX value of “1”, indicating male. &nbsp;And POPULATION\/1 simply counts the number of people in the region.<\/p>\n<p>&nbsp;<\/p>\n<p>Trait Field and Total Field can contain a fixed number instead of a field name, and this value will be used instead of the data tables. &nbsp;For example, HOUSEHOLDS\/1 will provide a count of the households that DP has placed into a region, and POPULATION\/1 will provide a count of the people placed.<\/p>\n<p>&nbsp;<\/p>\n<hr \/><p style=\"text-align:right;\"><img id=\"pbImage668634\" style=\"float:left;border-width:0px;\" src=\"\/f\/1274336673\/cerl.png\" alt=\"\" width=\"30\" height=\"24\" \/>Next: &nbsp;<a href=\"\/Running-Digital-Populations\">Running Digital Populations<\/a><\/p>","locked":false,"mtime":1288986186,"name":"The Relationship File GUI","oid":26393788,"perms":{"r":true},"revcount":6,"revurl":"http:\/\/digitalpopulations.pbworks.com\/w\/page\/26393788\/The%20Relationship%20File%20GUI","size":9646,"wikistyle":false}
*/
